Repository: 84000/data-translation-memory
Catalog: Toh_252-The_Fourfold_Accomplishment-v2.tmx
Source language: bo
Languages: en

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཟུང་དུ་འབྲེལ་བར་འགྱུར་བའོ། །
en: “Divine being, these are the four ways that bodhisattvas integrate the teachings:

source: བསམ་པ་དང་སྦྱོར་བ་ཟུང་དུ་འབྲེལ་པ་དང་།
en: integrating intention with application,

source: གཏོང་བ་དང་བསྔོ་བ་ཟུང་དུ་འབྲེལ་བ་དང་།
en: integrating giving away with dedication,

source: བྱམས་པ་དང་སྙིང་རྗེ་ཟུང་དུ་འབྲེལ་པ་དང་།
en: integrating love with compassion, and

source: ཐབས་དང་ཤེས་རབ་ཟུང་དུ་འབྲེལ་པ་སྟེ།
en: integrating method with wisdom.

source: !ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒྲིབ་པའི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: “Divine being, these four dreams are consequences of the bodhisattvas’ Dharma obscurations:

source: ཁྲོན་པ་རྡུལ་ཅན་མཐོང་ཞིང་དེའི་གཏིང་ན་ཡང་ཟླ་བའི་དཀྱིལ་འཁོར་མཐོང་བ་དང་།
en: seeing a dirty well yet still seeing the moon at the bottom;

source: མཚེའུ་འམ། རྫིང་བུའམ། ཁྲོན་པ་རྙོག་པ་ཅན་མཐོང་ཞིང་། དེའི་གཏིང་ན་ཡང་ཟླ་བའི་དཀྱིལ་འཁོར་མཐོང་བ་དང་།
en: seeing a muddy pond, pool, or well yet still seeing the moon at the bottom;

source: བར་སྣང་ལ་སྤྲིན་ཆེན་པོས་ཡོག་ཅིང་དེ་ལ་ཡང་ཟླ་བའི་དཀྱིལ་འཁོར་མཐོང་བ་དང་།
en: seeing the moon although the sky is cloudy; and

source: བར་སྣང་ལ་རླུང་དང་། རྡུལ་དང་། དུ་བས་འཁྲིགས་པར་མཐོང་ཞིང་། དེ་ལ་ཡང་ཟླ་བའི་དཀྱིལ་འཁོར་མཐོང་བ་སྟེ།
en: seeing the moon although the sky appears shrouded in wind, dust, and smoke.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལས་ཀྱི་སྒྲིབ་པའི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: “Divine being, these four dreams are consequences of the bodhisattvas’ karmic obscurations:

source: གཡང་ས་ཆེན་པོ་ནས་བདག་གཡང་དུ་ལྷུང་བར་མཐོང་བ་དང་།
en: seeing oneself fall from a high cliff into an abyss;

source: ལམ་མཐོ་དམའ་ཅན་དུ་མཐོང་བ་དང་།
en: seeing a road with highs and lows;

source: བདག་ལམ་སྲང་དོག་པར་ཞུགས་པར་མཐོང་བ་དང་།
en: seeing oneself set out on a narrow roadway;

source: རྨི་ལམ་ན་ཕྱོགས་བསླད་ཅིང་འཇིགས་པ་མང་པོ་མཐོང་བ་སྟེ།
en: being lost in the dream and seeing many terrifying things.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཉོན་མོངས་པའི་སྒྲིབ་པའི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: “Divine being, these four dreams are consequences of the bodhisattvas’ afflictive obscurations:

source: དུག་དྲག་པོས་འཁྲུགས་པར་མཐོང་བ་དང་།
en: seeing someone convulsing due to a strong poison,

source: གཅན་གཟན་གཏུམ་པོ་ཕལ་པོ་ཆེའི་སྒྲ་ཐོས་པ་དང་།
en: hearing the call of a large pack of vicious predators,

source: བདག་གཡོན་ཅན་གྱི་ནང་ན་གནས་པར་མཐོང་བ་དང་།
en: seeing oneself living among rogues, and

source: བདག་གི་ལུས་དྲི་མ་ཅན་དང་གོས་དྲི་མ་ཅན་དུ་མཐོང་བ་སྟེ།
en: seeing one’s body and clothing covered with filth.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་འཐོབ་པའི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: “Divine being, these four dreams are consequences of the bodhisattvas’ attaining dhāraṇī:

source: གཏེར་ཆེན་པོ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་གང་བ་མཐོང་བ་དང་།
en: seeing a great treasure chest filled with many jewels,

source: རྫིང་བུ་མེ་ཏོག་པད་མ་རྒྱས་པས་ཡོངས་སུ་གང་བ་མཐོང་བ་དང་།
en: seeing a pool filled with blooming lotus flowers,

source: བདག་གོས་དཀར་པོའི་ཕྲུགས་རྙེད་པར་མཐོང་བ་དང་།
en: seeing oneself finding a bundle of white cloth, and

source: ལྷ་ཞིག་སྤྱི་བོའི་གཙུག་ན་གདུགས་འཛིན་པར་མཐོང་བ་སྟེ།
en: seeing a god with a parasol being held over his head.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་ཐོབ་པའི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: “Divine being, these four dreams are consequences of the bodhisattvas’ attaining absorption:

source: བུ་མོ་བཟང་མོ་རྒྱན་བཟང་པོས་བརྒྱན་པ་མེ་ཏོག་སིལ་མ་འབུལ་བར་མཐོང་བ་དང་།
en: seeing an attractive girl with beautiful jewelry who offers worship by scattering flowers,

source: ནམ་མཁའ་ལ་བྱ་ངང་པ་དཀར་པོ་ཐལ་ཀར་གྱི་ཁྱུ་སྐད་འབྱིན་ཅིང་འགྲོ་བར་མཐོང་བ་དང་།
en: seeing a flock of pure white swans flying in the sky and calling out,

source: དེ་བཞིན་གཤེགས་པ་འོད་མང་པོས་བརྒྱན་པའི་ཕྱག་སྤྱི་བོར་འཇོག་པ་མཐོང་བ་དང་།
en: seeing the hand of the luminous Thus-Gone One being placed on the top of one’s head, and

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་པད་མ་ལ་བཞུགས་ཤིང་བསམ་གཏན་མཛད་པར་མཐོང་བ་སྟེ།
en: seeing the Thus-Gone One seated on a lotus and engaged in concentration.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པ་མཐོང་བའི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: “Divine being, these four dreams are consequences of the bodhisattvas’ seeing the Thus-Gone One:

source: ཟླ་བའི་དཀྱིལ་འཁོར་འཆར་བར་མཐོང་བ་དང་།
en: seeing a moonrise,

source: ཉི་མའི་དཀྱིལ་འཁོར་འཆར་བར་མཐོང་བ་དང་།
en: seeing a sunrise,

source: མེ་ཏོག་པད་མ་ཁ་འབུས་པར་མཐོང་བ་དང་།
en: seeing a lotus flower opening, and

source: ཚངས་པའི་དབང་པོ་རབ་ཏུ་ཞི་བའི་སྤྱོད་ལམ་མཐོང་བ་སྟེ།
en: seeing the lord of the Brahmā realms in the posture of utter quiescence.

source: ལྷའི་བུ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པ་མཐོང་བའི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: Divine being, those four dreams are consequences of the bodhisattvas’ seeing the Thus-Gone One.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རང་གི་མཚན་ཉིད་ཀྱི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: “Divine being, these four dreams are consequences of the bodhisattvas’ particular characteristics:

source: ཤིང་སཱ་ལ་ཆེན་པོའི་འདབ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་སྣ་ཚོགས་ཀྱིས་གང་བར་མཐོང་བ་དང་།
en: seeing a great sāla tree that is full of brilliantly colored leaves, flowers, and fruits;

source: ཁར་བའི་སྣོད་གསེར་གྱིས་གང་བར་མཐོང་བ་དང་།
en: seeing a metal bowl filled with gold;

source: ནམ་མཁའི་ངོས་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱིས་གང་བར་མཐོང་བ་དང་།
en: seeing the sky filled with parasols, banners, and standards; and

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཆེན་པོ་མཐོང་བ་སྟེ།
en: seeing a great universal emperor.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདུད་འདུལ་བའི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: “Divine being, these four dreams are consequences of the bodhisattvas’ taming Māra:

source: གྱད་ཆེན་པོས་གྱད་ཐམས་ཅད་མནན་ནས་བ་དན་ཐོགས་ཏེ་
en: seeing a great champion overcome all of the enemy’s champions, raise a standard, and advance;

source: འགྲོ་བར་མཐོང་བ་དང་། དཔའ་བོ་ཆེན་པོས་གཡུལ་ལས་འདས་ཏེ་
en: seeing a great hero defeat an army and then advance;

source: འགྲོ་བར་མཐོང་བ་དང་། རྒྱལ་པོ་དབང་བསྐུར་བར་མཐོང་བ་དང་།
en: seeing a king being consecrated; and

source: བདག་ཉིད་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ཅིང་བདུད་འདུལ་བར་མཐོང་བ་སྟེ།
en: seeing oneself sitting at the seat of awakening and taming Māra.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕྱིར་མི་ལྡོག་པའི་རྟགས་ཀྱི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: “Divine being, these are the four corresponding dreams that are signs of the bodhisattvas’ non-regression:

source: མགོ་ལ་ཐོད་དཀར་པོས་བཅིངས་པར་མཐོང་བ་དང་།
en: seeing a white diadem affixed on one’s head,

source: བདག་གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་བྱེད་པར་མཐོང་བ་དང་།
en: seeing oneself making unstinting offerings,

source: བདག་ཆོས་ཀྱི་སྟན་ཆེན་པོ་ལ་འདུག་པར་མཐོང་བ་དང་།
en: seeing oneself seated on a great Dharma seat, and

source: དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་ཤིང་ཆོས་སྟོན་པར་མཐོང་བ་སྟེ།
en: seeing the Thus-Gone One sitting at the seat of awakening and teaching the Dharma.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་འཐོབ་པའི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: “Divine being, these four dreams are consequences of the bodhisattvas’ attainment of the seat of awakening:

source: བུམ་པ་མཐོང་བ་དང་།
en: seeing a vase;

source: བྱ་ཙ་ཤས་བསྐོར་བར་མཐོང་བ་དང་།
en: seeing oneself surrounded by blue roller birds;

source: གང་དང་གང་དུ་འགྲོ་བ་དེ་དང་དེ་ཉིད་དུ་ཤིང་ཐམས་ཅད་ལྡང་ཞིང་འདུད་ལ་ཕྱག་འཚལ་བར་བྱེད་པ་དང་།
en: seeing that wherever one goes, all of the trees first reach upward, then bow and pay homage; and

source: གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་སྣང་བ་ཆེན་པོ་མཐོང་བ་སྟེ།
en: seeing a bright golden light.

source: ལྷའི་བུ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་འཐོབ་པའི་རྒྱུ་འཐུན་པའི་རྨི་ལམ་མོ། །
en: Divine being, those four dreams are consequences of the bodhisattvas’ attainment of the seat of awakening.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཞི་པ་སྒྲུབ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་དང་།
en: When Mañjuśrī­kumāra­bhūta gave this Dharma teaching on The Fourfold Accomplishment,

source: ལྷའི་བུ་དཔལ་བཟངས་ལྡན་དགའ་མགུ་ཡི་རངས་ཏེ།
en: the god Śrībhadra was happy and rejoiced.

source: རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: Since he had become exceedingly happy, delighted, and joyful,

source: འཁོར་དང་བཅས་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དང་། ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དག་གིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་གཏོར་ཏོ། །
en: he and his retinue showered the entire retinue with divine mandārava flowers as well as blue, pink, red, and white lotus flowers as an offering to Mañjuśrī­kumāra­bhūta.

source: མེ་ཏོག་དེ་དག་གཏོར་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་སྟེང་གི་བར་སྣང་ལ་མེ་ཏོག་པད་མ་ཤིང་རྟའི་འཕང་ལོ་ཙམ་གྱི་ཚད་བལྟ་ན་སྡུག་པ་བསུང་དང་ལྡན་པ་ཡིད་དུ་འོང་བ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: As soon as they had scattered the flowers, through the power of the Buddha, beautiful, fragrant, and delightful lotus flowers the size of chariot wheels appeared in the sky above them.

source: མེ་ཏོག་དེ་དག་གི་དབུས་ཀྱི་སྙིང་པོ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལུས་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་པ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: In the center of each of the flowers were bodhisattvas ornamented with the thirty-two marks of a great being.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལྷའི་བུ་དཔལ་བཟངས་ལྡན་གྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the god Śrībhadra asked Mañjuśrī­kumāra­bhūta,

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གང་ནས་ལྷགས།
en: “Mañjuśrī, where did these bodhisattvas come from?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་མེ་ཏོག་འདི་དག་ག་ལས་འོངས་པ་ཉིད་ནས་སོ། །
en: “Divine being, where did these flowers of yours come from?” Mañjuśrī asked in return.

source: ལྷའི་བུས་སྨྲས་པ། འཇམ་དཔལ་མེ་ཏོག་འདི་དག་ནི་སྤྲུལ་པ་སྟེ།
en: “Mañjuśrī,” replied the god, “these flowers are emanations—

source: བདག་གིས་ཁྱོད་ལ་མཆོད་པའི་ལས་བགྱི་བའི་སླད་དུ་གཏོར་ཏོ། །
en: I scattered them to make an offering to you.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī then said,

source: ལྷའི་བུ་ཇི་ལྟར་མེ་ཏོག་འདི་དག་སྤྲུལ་པ་ཡིན་པ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་ལུས་ལའང་དེ་བཞིན་དུ་བལྟའོ། །
en: “Divine being, you should view the bodies of those bodhisattvas just as you view these flowers—as emanations.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་དོ། །
en: At that moment the Blessed One smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་གི་ཚེ་འཛུམ་པ་མཛད་པའི་ཆོས་ཉིད་དེ། དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་ཁ་དོག་དུ་མ་འདི་ལྟ་སྟེ།
en: As happens when the blessed buddhas smile, a multitude of light rays of various colors—

source: སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། ཤེལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་ངོ་། །
en: blue, yellow, red, white, violet, and crystalline—emanated from the mouth of the Blessed One.

source: དེ་དག་གིས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་སྣང་བས་ཁྱབ་པར་བྱས་ནས།
en: These light rays pervaded infinite and limitless world systems and

source: སྟེང་དུ་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་བྱུང་སྟེ།
en: reached all the way up to the realm of Brahmā above.

source: གཟི་བརྗིད་ཀྱིས་ཉི་མ་དང་ཟླ་བའི་གཟི་བརྗིད་ཟིལ་གྱིས་མནན་ནས་སླར་ལོག་སྟེ།
en: Their splendor outshone the radiance of the sun and the moon.

source: བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་བོ། །
en: Then the light rays returned and dissolved into the Blessed One’s crown.

source: དེ་ནས་ལྷའི་བུ་དཔལ་བཟངས་ལྡན་སྟན་དེ་ལས་ལངས་ཏེ།
en: At that point the god Śrībhadra rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: arranged his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: Joining his palms, he bowed toward the Blessed One and

source: བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པས་བསྟོད་པ།
en: praised the Blessed One with these verses:

source: གསེར་བཟང་དྲི་མ་མེད་པའི་འོད་ཀྱིས་གཟི་བརྗིད་ལྡན། །
en: “You shine with light rays of the purest gold,

source: སྐྱེས་ཆེན་མཚན་མཆོག་སུམ་ཅུ་རྩ་གཉིས་སྣ་ཚོགས་མངའ། །
en: You possess the thirty-two supreme marks of a great being,

source: ཡོན་ཏན་ཁྲག་ཁྲིག་ཡོན་ཏན་གཞལ་ཡས་གཟི་བརྗིད་ཅན། །
en: You are resplendent with innumerable billions of good qualities—

source: མགོན་པོ་ཅི་ཡི་སླད་དུ་འཛུམ་པ་སྟོན་པ་མཛད། །
en: Protector, please explain why you are smiling.

source: སྒྲ་སྙན་འབྱིན་པར་མཛད་ཅིང་རབ་ཏུ་གསུང་འབྲེལ་བ། །
en: “Your voice is pleasant, and your speech exalted;

source: ཚངས་པའི་དབྱངས་སུ་གསུང་ཞིང་འཇམ་པའི་ཚིག་གསུང་བ། །
en: You speak with the voice of Brahmā, using tender words.

source: ནོར་བདུན་འོད་ཟེར་རྒྱ་ཆེན་བདེ་གཤེགས་བློ་གྲོས་ལྡན། །
en: Wise Sugata, you shine brightly with the seven riches

source: ཀ་ལ་པིང་ཀའི་གསུང་ཅན་ཅི་སླད་འཛུམ་པ་གསུངས། །
en: And your voice is like a cuckoo—please explain why you are smiling.

source: མི་མཆོག་སྐྱེས་བུ་དམ་པ་ངན་པའི་ཚོགས་ཅན་འདུལ། །
en: “Supreme human, holy being who subdued the one with a wicked horde,

source: བདུད་ཀྱི་སྟོབས་ནི་རྟག་པར་མཐའ་མར་འབྱིན་པར་མཛད། །
en: You have permanently and decisively eradicated Māra’s power.

source: ལྷ་དང་ལྷ་མིན་ནམ་མཁའ་ལྡིང་གིས་རྟག་མཆོད་པ། །
en: The gods, asuras, and garuḍas continually worship you—

source: སྟོབས་བཅུ་ལྡན་པས་ཅི་སླད་འཛུམ་པ་བསྟན། །
en: Wielder of the ten powers, please explain why you are smiling.

source: དྲི་མེད་དྲི་བྲལ་དྲི་མ་གསུམ་སྤངས་པ། །
en: “Stainless, uncontaminated, and free from the three defilements,

source: ཟླ་བ་ཉ་བའི་དཀྱིལ་འཁོར་ལྟ་བུར་ཞལ་རྒྱས་པ། །
en: Your broad face is like the full moon.

source: མུན་པ་རབ་རིབ་སྒྲིབ་པའི་རྡུལ་གྱི་ཉེས་གཅོད་པ། །
en: You cut through faults that, like dust, shroud our vision in darkness,

source: བདེ་དང་བདེ་ལྡན་སྦྱིན་པར་མཛད་པ་འཛུམ་དོན་གསུངས། །
en: And you bring joy and happiness—please explain why you are smiling.

source: བདེ་བར་གཤེགས་པ་ས་དང་ལྷ་ཡུལ་ཕན་པ་མཆོག །
en: “Blissful one, supreme benefactor of the earth and the god realms

source: བདེ་དང་བདེ་ལྡན་སྦྱིན་མཛད་ཡོན་ཏན་མཐའ་ཡས་པ། །
en: Who brings joy and happiness, whose qualities are limitless,

source: མཚུངས་ཤིང་འབྲེལ་ལ་ལེགས་གསུངས་གསལ་བའི་གསུང་ལྡན་པ། །
en: Whose clear speech perfectly teaches in a way that is appropriate and relevant—

source: འཛུམ་བསྟན་འདི་ཡི་དོན་ནི་ཇི་ལྟར་རྟོགས་པར་བགྱི། །
en: Please make us understand the reason that you smile.

source: ལིང་ཏོག་སྟུག་པོ་མུན་པ་རབ་རིབ་རྣམ་བསལ་བ། །
en: “You remove the thick film that shrouds our eyes in darkness,

source: ཤེས་རབ་སྒྲོན་མ་འོད་ཀྱི་གཟི་བརྗིད་ལྡན་པ་པོ། །
en: You wield the brilliant radiance of the torch of insight,

source: གླང་ཆེན་ཁྱུ་མཆོག་སྟོབས་དང་སེང་གེའི་སྟབས་ལྟར་བརྗིད། །
en: You have the power of the leader of a herd of elephants and the majestic gait of a lion,

source: འགྲོ་བའི་དོན་མཛད་འཛུམ་པའི་དོན་ནི་བསྟན་དུ་གསོལ། །
en: And you benefit beings—please explain why you are smiling.

source: མི་ཡི་དམ་པ་མི་ངན་ཚོགས་ཅན་འདུལ་མཛད་པ། །
en: “Supreme human, you tame hordes of wicked people.

source: ཟབ་ཅིང་མཐོང་བར་དཀའ་ལ་གཏིང་ཚོད་དཔག་དཀའ་བ། །
en: Incomparable one, you dry up the waters of existence,

source: སྲིད་པའི་ཆུ་ནི་སྐེམས་མཛད་མཉམ་པ་མེད་པ་ཅན། །
en: Which are so deep, hard to fathom, and difficult to measure.

source: སྒྱུ་མེད་སྟོབས་བཅུ་ལྡན་གྱིས་འཛུམ་པ་ཅི་སླད་བསྟན། །
en: You are undeceiving and possess the ten powers—please explain why you are smiling.

source: རྒ་ཤི་ཞི་བར་བགྱི་བའི་བདུད་རྩིའི་དོན་སྩོལ་བ། །
en: “You grant the goal of immortality that pacifies old age and death.

source: ཞབས་ནི་འཇམ་ཞིང་དྲ་བ་དག་དང་འཁོར་ལོར་ལྡན། །
en: Your feet are supple, webbed, and marked with wheels.

source: བླུན་པ་སྦྱོང་མཛད་སྲིད་པ་གསུམ་ན་མཉམ་མེད་པ། །
en: You dispel stupidity and are unequaled in the threefold world.

source: ཡེ་ཤེས་ཆེན་པོ་མངའ་བས་འཛུམ་དོན་བསྟན་དུ་གསོལ། །
en: Master of sublime gnosis, please explain why you are smiling.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དཔལ་བཟངས་ལྡན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Divine being,” the Blessed One replied to Śrībhadra,

source: ལྷའི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྟེང་གི་བར་སྣང་ལ་སེང་གེའི་ཁྲི་ལ་པད་མའི་སྙིང་པོ་ལ་འཁོད་པ་འདི་དག་མཐོང་ངམ། གསོལ་པ།
en: “do you see these bodhisattvas in the sky above who are seated in the center of lotuses on lion thrones?”

source: བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “Yes, Blessed One, I see them.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “Divine being,” the Blessed One then explained,

source: ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་བཅུ་ནས་འདུས་པ་འདི་དག་ཐམས་ཅད་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་དྲུང་དུ་ཆོས་མཉན་པ་དང་།
en: “all these bodhisattvas have gathered from the ten directions to hear the Dharma in the presence of Mañjuśrī­kumāra­bhūta.

source: བཞི་པ་སྒྲུབ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་པའི་ཕྱིར་ལྷགས་སོ། །
en: They have come to hear this Dharma teaching on The Fourfold Accomplishment.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ཐམས་ཅད་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་ཡིན་ནོ། །
en: Mañjuśrī­kumāra­bhūta ripened all these bodhisattvas.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ཐམས་ཅད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་ཡིན་ཏེ།
en: All these bodhisattvas are now only one birth away from unsurpassed and perfect awakening.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མིང་སྣ་ཚོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དང་གཞན་དག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: They will fully awaken to unsurpassed and perfect buddhahood in one buddhafield or another, each with their various names, throughout the worlds in the ten directions.”

source: ལྷའི་བུས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གི་གྲངས་རྟོགས་པར་རྔོ་མི་ཐོགས་ན་ཇི་སྙེད་ཅིག་མཆིས།
en: “Blessed One,” the god replied, “I cannot comprehend the number of bodhisattvas here—how many are there?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then asked Venerable Śāriputra,

source: ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གི་གྲངས་རྟོགས་པར་ནུས་སམ། གསོལ་པ།
en: “Śāriputra, can you comprehend how many bodhisattvas there are here?”

source: བཅོམ་ལྡན་འདས་བདག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་གང་སྐར་མའི་གཟུགས་དེ་དག་ཐམས་ཅད་ནི་སྐད་ཅིག །ཐང་ཅིག །ཡུད་ཙམ་གཅིག་གིས་བགྲང་བར་སྤྲོའི།
en: “Blessed One,” said Śāriputra, “in one instant, one moment, or one second, I can count all the stars in an entire three-thousandfold universe.

source: བཅོམ་ལྡན་འདས་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་ལོ་བརྒྱར་ཡང་བགྲང་བར་སྤྲོ་བ་མ་ལགས་སོ། །
en: However, Blessed One, I would be unable to count these bodhisattvas even in a hundred years.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་གལ་ཏེ་འཛམ་བུའི་གླིང་འདི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གྱིས་གང་བར་གྱུར་ཀྱང་།
en: “Śāriputra,” the Blessed One replied, “even if this continent of Jambūdvīpa were filled with minute particles,

source: རྡུལ་ཕྲ་རབ་དེ་བགྲང་བའི་ཚུལ་གྱིས་མཐའ་རྟོགས་པར་ནུས་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་བགྲང་བའི་ཚུལ་གྱིས་མཐའ་རྟོགས་པར་མི་ནུས་ཏེ
en: it would be possible to determine their number by counting them. However, it would be impossible to determine the number of these bodhisattvas by counting them,

source: བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་འདི་དག་ནི་དེ་ཙམ་དུ་ཚད་མེད་དོ། །
en: because the bodhisattvas that have gathered here are that innumerable.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གང་དུ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་སྙེད་མཆིས་པར་ག་ལ་འགྱུར།
en: “Blessed One, how can there be that many buddhafields in which these bodhisattvas will fully awaken to buddhahood?” asked Śāriputra.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ཁ་རོག་འདུག་དེ་སྐད་མ་སྨྲ་ཞིག །
en: “Silence, Śāriputra, do not say that,” replied the Blessed One.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་དག་དེ་བཞིན་གཤེགས་པས་སྟོང་ངོ་། །
en: “Śāriputra, the thus-gone ones empty countless buddhafields.

source: ཤཱ་རིའི་བུ་ཡོངས་སུ་བརྟགས་པ་བཟུང་ན།
en: Consider this, Śāriputra:

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཚེའི་ཚད་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གྱུར་ལ།
en: The lifespan of the thus-gone ones lasts for as many eons as there are grains of sand in the Ganges.

source: ཉི་མ་རེ་རེ་ཐམས་ཅད་ལའང་ཆོས་བཤད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འཇུག་པར་གྱུར་ཅིང་
en: Each and every day each one delivers as many Dharma teachings as there are grains of sand in the Ganges,

source: ཆོས་བཤད་པ་ཐམས་ཅད་ལའང་བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལུང་བསྟན་པར་གྱུར་ལ།
en: and in all of those Dharma teachings he prophesies as many bodhisattvas as there are grains of sand in the Ganges.

source: གང་གིས་ཤར་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་ནསབྱང་ཆུབ་སེམས་དཔའ་གཅིག་མཚན་མར་བཞག་ཀྱང་།
en: Even if one were to identify a single bodhisattva to the east, beyond as many buddhafields as there are grains of sand in the Ganges,

source: སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་དེ་བཞིན་གཤེགས་པ་དག་གིས་དེ་ཙམ་དུ་སྟོང་ན།
en: the thus-gone one will empty that many buddhafields.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གང་དེ་བཞིན་གཤེགས་པའི་ཤའི་སྤྱན་ཐ་མལ་པས་གཟིགས་པར་འགྱུར་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་དུ་སྐྱེས་པའི་སེམས་ཅན་དེ་དག་གི་སེམས་དེ་བཞིན་གཤེགས་པས་མཁྱེན་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་སྟོང་པ་ལྟ་ཅི་སྨོས།
en: Therefore, it goes without saying that the thus-gone ones, who know the minds of all beings born into the buddhafields of the ten directions, whom they perceive with the ordinary, corporeal eye of a thus-gone one, will empty all those buddhafields.”

source: དེ་ནས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་དུ་གྱུར་ནས།
en: At that point the great hearers and the entire retinue were amazed and exclaimed,

source: ཚིག་འདི་སྐད་དུ་བདག་ཅག་གི་སྟོན་པ་དེ་དག་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ། དེ་ལྟར་མཐུ་ཆེ་བ། དེ་ལྟར་ཡེ་ཤེས་གཟིགས་པ་ཆེན་པོ་དང་ལྡན་ཏེ།
en: “Our teachers have such vast magical powers, are so mighty, and have such great supreme knowledge!

source: བདག་ཅག་གིས་རྙེད་པ་ལེགས་པར་རྙེད་དོ། །ཞེས་སྨྲས་སོ། །
en: We are so fortunate!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་གང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པ་སྟེང་གི་བར་སྣང་ལ་འཁོད་པ་དེ་དག་བར་སྣང་དེ་ལས་བབས་ནས།
en: The bodhisattvas who had assembled from the worlds in the ten directions and hovered in the air now descended from the sky and

source: བཅོམ་ལྡན་འདས་དང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བསྐོར་ནས་ཕྱོགས་བཅུར་དོང་ངོ་། །
en: bowed their heads at the feet of the Blessed One and Mañjuśrī­kumāra­bhūta, circumambulated them, and then departed into the ten directions.

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་མཛད་པ་མཛད་ཅིང་སེམས་ཅན་ཚད་མེད་པ་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་མཛད་པ་ལེགས་སོ་ལེགས་སོ། །
en: “Mañjuśrī, you performed these deeds and ripened countless beings for awakening—well done!

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཡོངས་སུ་སྨིན་པར་བགྱིད་པའི་ཆོས་ལས་བརྩམས་ཏེ་སྤོབས་པར་མཛོད་ཅིག །
en: Mañjuśrī, please grace us with your eloquence, beginning with the teachings that ripen the awakening of bodhisattvas.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཆོས་ནི་སུམ་ཅུ་རྩ་ལྔའོ། །
en: “Divine being,” replied Mañjuśrī, “there are thirty-five teachings that ripen the awakening of bodhisattvas.

source: སུམ་ཅུ་རྩ་ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: The thirty-five teachings are these:

source: དུས་སུ་སྐུལ་བ་དང་།
en: urging them toward timeliness;

source: ཚོད་ལ་སྐུལ་བ་དང་།
en: urging them toward moderation;

source: རན་པར་སྐུལ་བ་དང་།
en: urging them toward proportion;

source: དབང་པོ་ལ་སྐུལ་བ་དང་།
en: urging them toward capacity;

source: བརྟན་པར་སྐུལ་བ་དང་།
en: urging them toward stability;

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྐུལ་བ་དང་།
en: urging them toward the perfections;

source: ཐབས་ལ་སྐུལ་བ་དང་།
en: urging them toward method;

source: ལྷག་པའི་བསམ་པ་ལ་སྐུལ་བ་དང་།
en: urging them toward the altruistic intention;

source: བྱམས་པ་ཆེན་པོ་ལ་སྐུལ་བ་དང་།
en: urging them toward great love;

source: སྙིང་རྗེ་ཆེན་པོ་ལ་སྐུལ་བ་དང་།
en: urging them toward great compassion;

source: ཐེག་པ་ཆེན་པོ་ལ་སྐུལ་བ་དང་།
en: urging them toward the Great Vehicle;

source: ཐེག་པ་དམན་པ་ལ་སྐུལ་བ་དང་།
en: urging them toward the Lesser Vehicle;

source: བདེན་པ་ལ་སྐུལ་བ་དང་།
en: urging them toward the truth;

source: དེ་བྱ་བ་ལ་སྐུལ་བ་དང་།
en: urging them to act on it;

source: ཆོས་སྲུང་བར་སྐུལ་བ་དང་།
en: urging them to protect the Dharma;
